<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description" content="enjoy"><title>[笔记]Training Products of Experts by Minimizing Contrastive Divergence | 水滴石穿</title><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/normalize/4.2.0/normalize.min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/0.6.0/pure-min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/0.6.0/grids-responsive-min.css"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.6.3/css/font-awesome.min.css"><script type="text/javascript" src="//cdn.bootcss.com/jquery/3.0.0/jquery.min.js"></script><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">[笔记]Training Products of Experts by Minimizing Contrastive Divergence</h1><a id="logo" href="/.">水滴石穿</a><p class="description">无止境探索，保持渴望，无所畏惧</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">[笔记]Training Products of Experts by Minimizing Contrastive Divergence</h1><div class="post-meta">May 11, 2014<span> | </span><span class="category"><a href="/categories/机器学习/">机器学习</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2014/05/11/Training-Products-of-Experts-by-Minimizing-Contrastive-Divergence/" href="/2014/05/11/Training-Products-of-Experts-by-Minimizing-Contrastive-Divergence/#comments" class="ds-thread-count"></a><div class="post-content"><p> &#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x521D;&#x89C1;&#x5728;hinton 2006 A Practical Guide to Training Restricted Boltzmann Machines,&#x4E0B;&#x79F0;&#x300A;Guide&#x300B;&#x3002;&#x300A;Guide&#x300B;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x8BAD;&#x7EC3;DBM&#x7684;&#x7B97;&#x6CD5;&#x6D41;&#x7A0B;&#x548C;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x7EC6;&#x8282;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x5E74;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5927;&#x725B;hinton&#x7684;&#x65E0;&#x79C1;&#x8D21;&#x732E;&#xFF0C;&#x5355;&#x662F;2006&#x5E74;&#x5C31;&#x6709;&#x4E24;&#x7BC7;&#x6587;&#x7AE0;&#x300A;A fast learning algorithm for deep belief nets&#x300B;&#x53CA;&#x5176;&#x9644;&#x5F55;&#x4E2D;&#x7684;&#x8BBA;&#x8BC1;&#x548C;&#x4F2A;&#x4EE3;&#x7801;&#x548C;SCIENCE&#x4E0A;&#x7684;&#x5927;&#x4F5C;&#x300A;Reducing the Dimensionality of Data with Neural Networks&#x300B;&#x548C;&#x76F8;&#x5E94;&#x7684;<a href="https://www.sciencemag.org/content/313/5786/504/suppl/DC1#below" target="_blank" rel="external">&#x7F51;&#x7AD9;&#x8D44;&#x6599;</a>&#x3002;&#x6750;&#x6599;&#x4E4B;&#x5168;&#x9762;&#xFF0C;&#x656C;&#x4EF0;&#xFF0C;&#x53CD;&#x590D;&#x7814;&#x8BFB;&#xFF0C;&#x5BF9;&#x8BAD;&#x7EC3;RBM&#x8FD9;&#x4E8B;&#x6709;&#x4E86;&#x70B9;&#x7709;&#x76EE;&#xFF0C;&#x6015;&#x81EA;&#x5DF1;&#x8BB0;&#x6027;&#x4E0D;&#x597D;&#x7ED9;&#x5FD8;&#x4E86;&#xFF0C;&#x7D22;&#x6027;&#x4E66;&#x5199;&#x4E0B;&#x6765;&#x3002;</p>
<h4 id="&#x53D7;&#x9650;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#x548C;PoE"><a href="#&#x53D7;&#x9650;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#x548C;PoE" class="headerlink" title="&#x53D7;&#x9650;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#x548C;PoE"></a>&#x53D7;&#x9650;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#x548C;PoE</h4><p>Restricted Boltzmann machines(RBMs)&#x4F5C;&#x4E3A;&#x751F;&#x6210;&#x6A21;&#x578B;&#x5E7F;&#x6CDB;&#x7528;&#x4E8E;&#x5F88;&#x591A;&#x7C7B;&#x578B;&#x6570;&#x636E;&#x7684;&#x5EFA;&#x6A21;&#xFF0C;&#x5305;&#x62EC;&#x6709;&#x6807;&#x8BB0;&#x6216;&#x8005;&#x65E0;&#x6807;&#x8BB0;&#x56FE;&#x7247;&#xFF0C;&#x6885;&#x5C14;&#x5012;&#x9891;&#x8C31;&#x7CFB;&#x6570;&#x7A97;(&#x4E00;&#x79CD;&#x8BED;&#x97F3;&#x8FA8;&#x8BC6;&#x4E2D;&#x7684;&#x7279;&#x5F81;&#x8868;&#x793A;&#xFF0C;&#x5E38;&#x79F0;&#x4E3A;MFCC)&#xFF0C;&#x6587;&#x6863;&#xFF0C;&#x4E5F;&#x6709;&#x7528;&#x4E8E;&#x65F6;&#x5E8F;&#x6570;&#x636E;&#x4F8B;&#x5982;&#x89C6;&#x9891;&#x6216;&#x8005;&#x8FD0;&#x52A8;&#x6355;&#x83B7;&#x6570;&#x636E;&#x3001;&#x6F14;&#x8BB2;&#x3002;&#x6700;&#x5E7F;&#x6CDB;&#x7684;&#x5E94;&#x7528;&#x8FD8;&#x662F;&#x5728;&#x8BAD;&#x7EC3;&#x548C;&#x6784;&#x9020;&#x6DF1;&#x5EA6;&#x7F6E;&#x4FE1;&#x7F51;&#x7EDC;&#x4E2D;&#x3002;</p>
<p>RBMs&#x901A;&#x5E38;&#x4F7F;&#x7528;contrastive divergence &#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x5C06;&#x662F;&#x672C;&#x7B14;&#x8BB0;&#x4E2D;&#x7684;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x5185;&#x5BB9;&#x3002;&#x5F53;&#x7136;&#x5728;&#x4F7F;&#x7528;&#x4E2D;&#x8FD8;&#x4F1A;&#x9047;&#x5230;&#x66F4;&#x7EC6;&#x8282;&#x5904;&#x7684;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#xFF0C;&#x8BF8;&#x5982;&#x5B66;&#x4E60;&#x7387;(learning rate)&#x3001;&#x52A8;&#x91CF;(momentum)&#x3001;&#x6743;&#x91CD;&#x4EE3;&#x4EF7;(weighted-cost)&#x3001;&#x7A00;&#x758F;&#x76EE;&#x6807;(sparcity target)&#x3001;&#x6743;&#x91CD;&#x7684;&#x521D;&#x59CB;&#x5316;(the initial values of the weights)&#x3001;&#x9690;&#x5355;&#x5143;&#x7684;&#x6570;&#x76EE;(the num of hidden units)&#x3001;&#x56FE;&#x50CF;&#x5B50;&#x96C6;&#x7684;&#x5927;&#x5C0F;(the size of each mini-batch)&#xFF0C;&#x5305;&#x62EC;&#x6BCF;&#x4E00;&#x6B21;&#x8BAD;&#x7EC3;&#x4E2D;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x76D1;&#x63A7;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x3001;&#x4EE5;&#x53CA;&#x4F55;&#x65F6;&#x505C;&#x6B62;&#x8BAD;&#x7EC3;&#x3002;&#x5982;&#x679C;&#x9047;&#x5230;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x8BF7;&#x79FB;&#x6B65;&#x300A;Guide&#x300B;&#x8FDB;&#x884C;&#x5BF9;&#x5E94;&#x67E5;&#x9605;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x8BAD;&#x7EC3;&#x56FE;&#x50CF;&#x4E3A;&#x4E8C;&#x503C;&#x56FE;&#x50CF;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x4E24;&#x5C42;&#x7684;RBM&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;RBM&#x800C;&#x8A00;&#xFF0C;&#x53EF;&#x89C1;&#x5C42;&#x7684;&#x4E8C;&#x503C;&#x7684;&#x50CF;&#x7D20;&#x70B9;$v_i$&#x4E0E;&#x9690;&#x542B;&#x5C42;&#x7684;&#x4E8C;&#x503C;&#x7279;&#x5F81;&#x76D1;&#x6D4B;&#x5668;$h_j$&#x5EFA;&#x7ACB;&#x5BF9;&#x79F0;&#x52A0;&#x6743;&#x5173;&#x8054;&#x3002;&#x5176;&#x80FD;&#x91CF;&#x5F0F;&#x4E3A;</p>
$$E({\bf{v}},{\bf{h}}) =  - \sum\limits_{i \in visible} {{a_i}{v_i}}  - \sum\limits_{j \in hidden} {{b_j}{h_j}}  - \sum\limits_{i,j} {{v_i}{h_j}{w_{ij}}} --------(1)  $$
<p>&#x5176;&#x4E2D;$v_i$,$h_j$&#x5206;&#x522B;&#x662F;&#x53EF;&#x89C1;&#x5355;&#x5143;$i$&#x548C;&#x9690;&#x542B;&#x5355;&#x5143;$j$&#x7684;&#x4E8C;&#x503C;&#x72B6;&#x6001;&#xFF0C;$a_i$&#xFF0C;$b_j$&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x504F;&#x7F6E;&#xFF0C;$w_{ij}$&#x4E3A;&#x5176;&#x6743;&#x91CD;&#x3002;&#x4E0B;&#x56FE;&#x4E3A;RBM&#x6A21;&#x578B;&#x793A;&#x610F;&#x56FE;</p>
<p>&#x901A;&#x8FC7;&#x80FD;&#x91CF;&#x65B9;&#x7A0B;&#xFF0C;RBM&#x4E3A;&#x6BCF;&#x4E00;&#x5BF9;&#x53EF;&#x89C1;&#x5411;&#x91CF;&#x548C;&#x9690;&#x542B;&#x5411;&#x91CF;&#x7684;&#x53EF;&#x80FD;&#x7EC4;&#x5408;&#x7ED9;&#x51FA;&#x4E86;&#x6982;&#x7387;&#x5206;&#x5E03;&#x516C;&#x5F0F;&#xFF1A;</p>
$$p({\bf{v}},{\bf{h}}) = {1 \over Z}{e^{ - E({\bf{v}},{\bf{h}})}} --------(2) $$
<p>&#x5176;&#x4E2D;&#xFF0C;&#x914D;&#x5206;&#x51FD;&#x6570;$Z$&#x4E3A;&#x53EF;&#x89C1;&#x5355;&#x5143;&#x548C;&#x9690;&#x542B;&#x5355;&#x5143;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7EC4;&#x5408;&#x7684;&#x6982;&#x7387;&#x4E4B;&#x548C;&#xFF1A;$$Z = \sum\nolimits_{v,h} {{e^{ - E({\bf{v}},{\bf{h}})}}} $$&#x3002;&#x5BF9;&#x4E8E;&#x53EF;&#x89C1;&#x5411;&#x91CF;$v$&#xFF0C;&#x5176;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x4E3A;</p>
$$p({\bf{v}}) = {1 \over Z}\sum\limits_h^{} {{e^{ - E({\bf{v}},{\bf{h}})}}} $$
<p>&#x4E0A;&#x9762;&#x662F;&#x5173;&#x4E8E;&#x6A21;&#x578B;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#xFF0C;hinton&#x5728;&#x672C;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x7528;&#x4E58;&#x79EF;&#x53E0;&#x52A0;&#x6A21;&#x578B;&#x4E3A;&#x5F15;&#x505A;&#x4E86;&#x7406;&#x8BBA;&#x4E0A;&#x7684;&#x63A8;&#x5BFC;&#x2013;<strong>PoE</strong>(Products of Experts,PoE)&#xFF0C;&#x548C;boost&#x65B9;&#x6CD5;&#x6709;&#x7C7B;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x6211;&#x7406;&#x89E3;&#x533A;&#x522B;&#x4E3B;&#x8981;&#x5728;&#x4E8E;boost&#x4E3A;&#x7EBF;&#x6027;&#x7EC4;&#x5408;&#xFF0C;PoE&#x4E3A;&#x975E;&#x7EBF;&#x6027;&#x3002;&#x5BF9;&#x4E8E;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5411;&#x91CF;&#xFF0C;&#x666E;&#x901A;&#x7684;&#x5355;&#x4E00;&#x6A21;&#x578B;(Export)&#x53EF;&#x4EE5;&#x7ED9;&#x51FA;&#x90E8;&#x5206;&#x6EE1;&#x8DB3;&#x5176;&#x9650;&#x5B9A;&#x6761;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x5411;&#x91CF;&#x7684;&#x9AD8;&#x6982;&#x7387;&#x63A8;&#x65AD;&#x3002;PoE&#x901A;&#x8FC7;&#x5C06;&#x4E0D;&#x540C;&#x7684;&#x6982;&#x7387;&#x6A21;&#x578B;&#x4E58;&#x79EF;&#x8D77;&#x6765;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x5BF9;&#x9AD8;&#x7EF4;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x62DF;&#x5408;&#xFF0C;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x4F8B;&#x5B50;&#x4E3A;&#x9AD8;&#x65AF;&#x6A21;&#x578B;&#x7684;&#x6DF7;&#x5408;&#x3002;&#x4F5C;&#x8005;&#x6307;&#x51FA;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x6DF7;&#x5408;&#x6A21;&#x578B;&#x4E2D;&#x6709;&#x8DB3;&#x591F;&#x591A;&#x6570;&#x91CF;&#x7684;&#x5355;&#x4E00;&#x6A21;&#x578B;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x51C6;&#x786E;&#x8FD1;&#x4F3C;&#x8868;&#x8FBE;&#x4EFB;&#x4F55;&#x5149;&#x6ED1;&#x7684;&#x5206;&#x5E03;&#x3002;&#x5728;&#x62DF;&#x5408;&#x6570;&#x636E;&#xFF0C;&#x5BF9;&#x4E8E;&#x6DF7;&#x5408;&#x6A21;&#x578B;&#x7684;&#x6C42;&#x89E3;&#x65B9;&#x6CD5;&#x6BD4;&#x8F83;&#x5E38;&#x7528;&#x7684;&#x6709;<a href="http://www.cnblogs.com/jerrylead/archive/2011/04/06/2006936.html" target="_blank" rel="external">EM&#x7B97;&#x6CD5;</a>&#x548C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5269;&#x4E0B;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x662F;&#x5982;&#x4F55;&#x5C06;PoE&#x6A21;&#x578B;&#x62DF;&#x5408;&#x5230;&#x6570;&#x636E;&#x4E86;&#xFF0C;&#x8FD9;&#x70B9;&#x4E0D;&#x592A;&#x597D;&#x505A;&#x3002;&#x4F5C;&#x8005;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x79CD;&#x5DE7;&#x5999;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5C06;&#x4F18;&#x5316;&#x76EE;&#x6807;&#xFF0C;&#x66FF;&#x6362;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x3002;&#x5F53;&#x7136;&#x4F1A;&#x5E26;&#x6765;&#x4E00;&#x5B9A;&#x7684;&#x635F;&#x5931;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x6211;&#x4EEC;&#x5728;&#x540E;&#x9762;&#x7684;&#x63A8;&#x5BFC;&#x91CC;&#x9762;&#x80FD;&#x770B;&#x5230;&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x5BF9;&#x4E8E;&#x6574;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x8BAD;&#x7EC3;&#x65B9;&#x4FBF;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x635F;&#x5931;&#x662F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#x3002;</p>
<h4 id="&#x4F7F;&#x7528;&#x6700;&#x5927;&#x4F3C;&#x7136;&#x6CD5;&#x8BAD;&#x7EC3;PoE"><a href="#&#x4F7F;&#x7528;&#x6700;&#x5927;&#x4F3C;&#x7136;&#x6CD5;&#x8BAD;&#x7EC3;PoE" class="headerlink" title="&#x4F7F;&#x7528;&#x6700;&#x5927;&#x4F3C;&#x7136;&#x6CD5;&#x8BAD;&#x7EC3;PoE"></a>&#x4F7F;&#x7528;&#x6700;&#x5927;&#x4F3C;&#x7136;&#x6CD5;&#x8BAD;&#x7EC3;PoE</h4><p>&#x8BA8;&#x8BBA;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x8BA1;&#x7B97;&#x5BFC;&#x6570;&#x7684;&#x5355;&#x4E00;&#x6A21;&#x578B;&#x3002;&#x6570;&#x636E;&#x5411;&#x91CF;${\bf{d}}$&#x5728;$n$&#x4E2A;&#x5355;&#x4E00;&#x6A21;&#x578B;&#x7EC4;&#x6210;&#x7684;PoE&#x4E2D;&#x7684;&#x6982;&#x7387;&#x4E3A;&#xFF1A;</p>
$$p({\bf{d}}|{\theta _1} \ldots {\theta _n}) = {{{\Pi _m}{p_m}({\bf{d}}|{\theta _m})} \over {\sum\nolimits_c {{\Pi _m}{p_m}({\bf{c}}|{\theta _m})} }} --------(3)$$
<p>&#x8BB0;${\bf{d}}$&#x4E3A;&#x79BB;&#x6563;&#x7A7A;&#x95F4;&#x7684;&#x6570;&#x636E;&#x5411;&#x91CF;&#xFF0C;${\theta _m}$&#x4E3A;&#x5355;&#x4E00;&#x6A21;&#x578B;$m$&#x7684;&#x6240;&#x6709;&#x53C2;&#x6570;&#xFF0C;${p_m}(d|{\theta _m})$&#x4E3A;&#x6A21;&#x578B;$m$&#x4E2D;${\bf{d}}$&#x7684;&#x6982;&#x7387;&#xFF0C;$c$&#x8868;&#x793A;&#x6570;&#x636E;&#x7A7A;&#x95F4;&#x4E2D;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x6570;&#x636E;&#x5411;&#x91CF;</p>
<p>&#x5C06;PoE&#x62DF;&#x5408;&#x5230;&#x4E00;&#x7EC4;<em>iid</em>&#x7684;&#x6570;&#x636E;&#x5411;&#x91CF;&#x4E0A;&#xFF0C;&#x5F88;&#x81EA;&#x7136;&#x5C31;&#x60F3;&#x5230;&#x5BF9;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5411;&#x91CF;&#x7684;log&#x4F3C;&#x7136;&#x6C42;&#x5BFC;&#xFF0C;&#x5F97;&#x5230;&#x4E0B;&#x9762;&#x7684;&#x5F0F;&#x5B50;&#xFF1A;<br>$${{\partial \log p({\bf{d}}|{\theta _1} \ldots {\theta _n})} \over {\partial {\theta _m}}} = {{\partial \log {p_m}({\bf{d}}|{\theta _m})} \over {\partial {\theta _m}}} - \sum\limits_c^{} {p({\bf{c}}|{\theta _1} \ldots {\theta _n})} {{\partial \log {p_m}({\bf{c}}|{\theta _m})} \over {\partial {\theta _m}}}---(4)$$</p>
<p>&#x7B49;&#x5F0F;&#x53F3;&#x8FB9;&#x7B2C;&#x4E8C;&#x9879;&#x6570;&#x636E;&#x53D8;&#x91CF;$c$&#x7684;log&#x6982;&#x7387;&#x7684;&#x5BFC;&#x6570;&#x671F;&#x671B;&#xFF08; <em>expected derivative</em> &#xFF09;&#x3002;&#x5047;&#x8BBE;&#x6BCF;&#x4E2A;&#x5355;&#x4E00;&#x6A21;&#x578B;&#x90FD;&#x5BB9;&#x6613;&#x6C42;&#x5BFC;&#xFF0C;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x53D8;&#x91CF;$c$&#x7684;&#x5206;&#x5E03;&#x800C;&#x8A00;&#xFF0C;&#x90A3;&#x4E48;&#x6BD4;&#x8F83;&#x96BE;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x5728;&#x4E8E;&#x4F30;&#x8BA1;&#x6570;&#x636E;&#x7684;log&#x6982;&#x7387;&#x7684;&#x5BFC;&#x6570;&#x3002;&#x5B9E;&#x73B0;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x591A;&#x79CD;&#xFF0C;&#x5BF9;&#x4E8E;&#x79BB;&#x6563;&#x6570;&#x636E;&#x53EF;&#x7528;&#x62D2;&#x7EDD;&#x91C7;&#x6837;&#xFF1A;PoE&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5355;&#x6A21;&#x578B;&#x5206;&#x522B;&#x72EC;&#x7ACB;&#x751F;&#x6210;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x5411;&#x91CF;&#xFF0C;&#x91CD;&#x590D;&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;&#x76F4;&#x5230;&#x6240;&#x6709;&#x7684;&#x5355;&#x6A21;&#x578B;&#x7ED3;&#x679C;&#x6070;&#x597D;&#x4E00;&#x81F4;&#x3002;&#x62D2;&#x7EDD;&#x91C7;&#x6837;&#x6BD4;&#x8F83;&#x5F62;&#x8C61;&#x5730;&#x8868;&#x8FBE;&#x4E86;PoE&#x5BF9;&#x6574;&#x4F53;&#x6982;&#x7387;&#x5206;&#x5E03;&#x7684;&#x62DF;&#x5408;&#xFF0C;&#x4F46;&#x662F;&#x6548;&#x7387;&#x4F4E;&#x3002;&#x4F7F;&#x7528;Gibbs&#x91C7;&#x6837;&#x7684;&#x9A6C;&#x5C14;&#x79D1;&#x592B;&#x94FE;&#x8499;&#x7279;&#x5361;&#x6D1B;MCMC&#x65B9;&#x6CD5;&#x6548;&#x7387;&#x66F4;&#x9AD8;&#x3002;&#x5728;Gibbs&#x91C7;&#x6837;&#x4E2D;&#xFF0C;&#x7ED9;&#x5B9A;&#x5F53;&#x524D;&#x5176;&#x4ED6;&#x53D8;&#x91CF;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5BF9;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x540E;&#x9A8C;&#x5206;&#x5E03;&#x8FDB;&#x884C;&#x91C7;&#x6837;&#x3002;&#x5BF9;&#x4E8E;RBM&#xFF0C;&#x7ED9;&#x5B9A;&#x4E86;&#x89C2;&#x5BDF;&#x6570;&#x636E;&#xFF0C;&#x6BCF;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x9690;&#x542B;&#x72B6;&#x6001;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x66F4;&#x65B0;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x6761;&#x4EF6;&#x72EC;&#x7ACB;&#x7684;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x5355;&#x6A21;&#x578B;&#x4E5F;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x6027;&#x8D28;&#xFF1A;&#x5728;&#x7ED9;&#x5B9A;&#x5355;&#x6A21;&#x578B;&#x7684;&#x9690;&#x542B;&#x72B6;&#x6001;&#xFF0C;&#x6570;&#x636E;&#x5411;&#x91CF;&#x7684;&#x5206;&#x5E03;&#x4E5F;&#x662F;&#x6761;&#x4EF6;&#x72EC;&#x7ACB;&#x7684;&#x3002;&#x90A3;&#x4E48;&#x9690;&#x542B;&#x548C;&#x53EF;&#x89C1;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x4E8C;&#x5206;&#x56FE;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x9690;&#x542B;&#x5C42;&#x548C;&#x53EF;&#x89C1;&#x5C42;&#x4E4B;&#x95F4;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x4E8C;&#x5206;&#x56FE;&#xFF0C;&#x7ED9;&#x5B9A;&#x9690;&#x542B;&#x5C42;&#x72B6;&#x6001;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x884C;&#x66F4;&#x65B0;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x5411;&#x91CF;(&#x5373;&#x53EF;&#x89C1;&#x5C42;&#x7684;&#x5355;&#x5143;)&#x3002;&#x4F7F;&#x7528;Gibbs&#x91C7;&#x6837;&#x53EF;&#x4EE5;&#x5728;&#x9690;&#x542B;&#x5C42;&#x548C;&#x53EF;&#x89C1;&#x5C42;&#x7684;&#x5E76;&#x884C;&#x66F4;&#x65B0;&#x4E2D;&#x8D8B;&#x8FD1;&#x6570;&#x636E;&#x53D8;&#x91CF;&#x7684;&#x771F;&#x5B9E;&#x5206;&#x5E03;&#x3002;</p>
<p>&#x4E0D;&#x5DE7;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x91C7;&#x6837;&#x524D;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x53EF;&#x4EE5;&#x63A5;&#x8FD1;&#x5747;&#x8861;&#x5206;&#x5E03;&#x867D;&#x7136;&#x53EF;&#x884C;&#xFF0C;&#x8FD9;&#x4F1A;&#x5E26;&#x6765;&#x4E86;&#x7B2C;&#x4E8C;&#x4E2A;&#x96BE;&#x9898;&#x3002;&#x5BF9;&#x5747;&#x8861;&#x5206;&#x5E03;&#x8FDB;&#x884C;&#x91C7;&#x6837;&#xFF0C;&#x7531;&#x4E8E;&#x6837;&#x672C;&#x6765;&#x81EA;&#x6A21;&#x578B;&#x7684;&#x5206;&#x5E03;&#xFF0C;&#x4F1A;&#x5448;&#x73B0;&#x51FA;&#x9AD8;&#x5EA6;&#x5DEE;&#x5F02;&#x6027;&#xFF0C;&#x8FD9;&#x79CD;&#x9AD8;&#x5EA6;&#x5DEE;&#x5F02;&#x6027;&#x4F7F;&#x5F97;&#x5BFC;&#x6570;&#x96BE;&#x4EE5;&#x8BA1;&#x7B97;&#x3002;</p>
<h4 id="&#x6700;&#x5C0F;&#x5316;&#x5BF9;&#x6BD4;&#x5206;&#x6B67;&#xFF08;contrastive-divergence&#xFF09;&#x8BAD;&#x7EC3;"><a href="#&#x6700;&#x5C0F;&#x5316;&#x5BF9;&#x6BD4;&#x5206;&#x6B67;&#xFF08;contrastive-divergence&#xFF09;&#x8BAD;&#x7EC3;" class="headerlink" title="&#x6700;&#x5C0F;&#x5316;&#x5BF9;&#x6BD4;&#x5206;&#x6B67;&#xFF08;contrastive divergence&#xFF09;&#x8BAD;&#x7EC3;"></a>&#x6700;&#x5C0F;&#x5316;&#x5BF9;&#x6BD4;&#x5206;&#x6B67;&#xFF08;contrastive divergence&#xFF09;&#x8BAD;&#x7EC3;</h4><p>&#x6700;&#x5927;&#x5316;&#x6570;&#x636E;&#x7684;log-&#x4F3C;&#x7136;&#x7B49;&#x4EF7;&#x4E8E;&#x6700;&#x5C0F;&#x5316;&#x6570;&#x636E;&#x5206;&#x5E03;$Q^0$&#x548C;&#x5747;&#x8861;&#x5206;&#x5E03;$Q^\infty $&#x7684;Kullback-Liebler divergence&#x3002;&#x5982;&#x524D;&#x6240;&#x8FF0;&#x5747;&#x8861;&#x5206;&#x5E03;$Q^\infty $&#x6765;&#x81EA;&#x4E8E;&#x751F;&#x6210;&#x6A21;&#x578B;&#x7684;Gibbs&#x91C7;&#x6837;&#x3002;<br>$${Q^0}||{Q^\infty } = \sum\limits_{}^{} {Q_d^0\log Q_d^0 - \sum\limits_{}^{} {Q_d^0\log Q_d^\infty } }  =  - H({Q^0}) -  &lt; \log Q_d^\infty { &gt; _{{Q^0}}}$$</p>
<p>&#x5176;&#x4E2D;||&#x7B26;&#x53F7;&#x8868;&#x793A;Kullback-Leibler divergence&#xFF0C;&#x5C16;&#x62EC;&#x53F7;&#x8868;&#x793A;&#x4E0B;&#x6807;&#x5F0F;&#x5BF9;&#x5E94;&#x5206;&#x5E03;&#x7684;&#x671F;&#x671B;&#xFF0C;$H(Q^0)$&#x4E3A;&#x6570;&#x636E;&#x5206;&#x5E03;&#x7684;&#x71B5;&#x3002;$Q^0$&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x6A21;&#x578B;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x4F18;&#x5316;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x4EE5;&#x5FFD;&#x89C6;$H(Q^0)$&#x3002;&#x6CE8;&#x610F;$Q_d^\infty$&#x53EA;&#x662F;$p(\bf{d}|\theta_1...\theta_n)$&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x3002;&#x516C;&#x5F0F;&#xFF08;4&#xFF09;&#x91CD;&#x5199;&#x4E3A;&#xFF1A;</p>
$${&lt; {{{\partial \log Q_d^\infty } \over {\partial {\theta _m}}}} &gt; _{{Q^0}}} = {&lt; {{{\partial \log {p_m}({\bf{d}}|{\theta _m})} \over {\partial {\theta _m}}}} &gt; _{{Q^0}}} - {&lt; {{{\partial \log {p_m}({\bf{c}}|{\theta _m})} \over {\partial {\theta _m}}}} &gt; _{{Q^\infty }}}----(5)$$
<p>&#x7ECF;&#x8FC7;&#x6539;&#x5199;&#x540E;&#xFF0C;&#x7528;&#x4E0A;&#x5F0F;&#x8BA1;&#x7B97;log-&#x4F3C;&#x7136;&#x7684;&#x6700;&#x5927;&#x503C;&#x66F4;&#x7B80;&#x5355;&#x548C;&#x6548;&#x7387;&#x9AD8;&#x3002;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x5305;&#x542B;&#x4E86;&#x53E6;&#x4E00;&#x79CD;&#x4F18;&#x5316;&#x53EF;&#x80FD;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x7528;&#x6700;&#x5C0F;&#x5316;${Q^0}||{Q^\infty }$&#x548C;${Q^1}||{Q^\infty }$&#x7684;&#x5DEE;&#xFF0C;$Q^1$&#x662F;&#x7ECF;&#x8FC7;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;Gibbs&#x91C7;&#x6837;&#x6B65;&#x9AA4;&#xFF0C;&#x91CD;&#x5EFA;&#x540E;&#x6570;&#x636E;&#x5411;&#x91CF;&#x7684;&#x5206;&#x5E03;&#x3002;</p>
<p>&#x6700;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x201C;constrastive divergence&#x201D;&#x7684;&#x76EE;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x4F7F;&#x7528;Gibbs&#x91C7;&#x6837;&#x5BF9;Markov chain&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x4F7F;&#x5F97;&#x521D;&#x59CB;&#x53EF;&#x89C1;&#x5C42;&#x5206;&#x5E03;$Q^0$&#x4E0D;&#x4F1A;&#x88AB;&#x6539;&#x53D8;&#x3002;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x628A;&#x8FD9;&#x4E2A;chain&#x63A8;&#x6F14;&#x5230;&#x5747;&#x8861;&#x5206;&#x5E03;&#xFF0C;&#x518D;&#x4E0E;&#x521D;&#x59CB;&#x5206;&#x5E03;&#x6BD4;&#x8F83;&#x6765;&#x6C42;&#x51FA;&#x5BFC;&#x6570;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EA;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7B80;&#x5316;&#x7248;&#x672C;&#xFF0C;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x8FD0;&#x884C;chain&#x4E00;&#x6B21;&#x5B8C;&#x6574;&#x7684;Gibbs&#x91C7;&#x6837;&#x6765;&#x66F4;&#x65B0;&#x53C2;&#x6570;&#xFF0C;&#x4F7F;&#x5F97;chain&#x521D;&#x59CB;&#x5206;&#x5E03;&#x5230;&#x7B2C;&#x4E00;&#x6B65;&#x91C7;&#x6837;&#x540E;&#x7684;&#x5206;&#x5E03;&#x4E4B;&#x95F4;&#x7684;&#x53D8;&#x5316;&#x4E0B;&#x964D;&#x8D8B;&#x52BF;&#x3002;&#x7406;&#x7531;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;$Q^1$&#x6BD4;$Q^0$&#x8DDD;&#x79BB;&#x5747;&#x8861;&#x5206;&#x5E03;&#x66F4;&#x8FD1;&#x4E00;&#x4E9B;&#xFF0C;&#x6211;&#x4EEC;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x201C;$Q^0||Q^{\infty}$ $ \ge $ $Q^1||Q^{\infty}$&#xFF0C;&#x7B49;&#x53F7;&#x6210;&#x7ACB;&#x7684;&#x6761;&#x4EF6;&#x662F;$Q^0=Q^1$&#x201D;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;contrastive divergence&#x4E0D;&#x4F1A;&#x4E3A;&#x8D1F;&#xFF0C;&#x5728;&#x4F20;&#x64AD;&#x8FC7;&#x7A0B;&#x4E2D;&#x6574;&#x4E2A;markov chains&#x90FD;&#x662F;&#x975E;&#x96F6;&#x6982;&#x7387;&#x3002;$Q^0=Q^1$&#x610F;&#x5473;&#x7740;$Q^0=Q^{\infty}$&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x6A21;&#x578B;&#x5F88;&#x5B8C;&#x7F8E;&#xFF0C;&#x4F1A;&#x51FA;&#x73B0;contrastive divergence&#x4E3A;&#x96F6;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x4ECE;&#x6570;&#x503C;&#x6C42;&#x89E3;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x516C;&#x5F0F;&#xFF08;5&#xFF09;&#x91CC;&#x9762;&#x7B49;&#x53F7;&#x53F3;&#x8FB9;&#x7B2C;&#x4E8C;&#x9879;&#x6BD4;&#x8F83;&#x96BE;&#x7B97;&#xFF0C;&#x901A;&#x8FC7;&#x6362;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5BF9;&#x5176;&#x76F4;&#x63A5;&#x6C42;&#x89E3;&#xFF1A;<br>$$ - {\partial  \over {\partial {\theta _m}}}({Q^0}||{Q^\infty } - {Q^1}||{Q^\infty }) = {&lt; {{{\partial \log {p_m}({\bf{d}}|{\theta _m})} \over {\partial {\theta _m}}}} &gt; _{{Q^0}}} - {&lt; {{{\partial \log {p_m}({\bf{\hat d}}|{\theta _m})} \over {\partial {\theta _m}}}} &gt; _{{Q^1}}} + {{\partial {Q^1}} \over {\partial {\theta _m}}}{{\partial {Q^1}||{Q^\infty }} \over {\partial {Q^1}}}--(6)$$</p>
<p>&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x5355;&#x6A21;&#x578B;&#x5BB9;&#x6613;&#x6C42;&#x89E3;&#xFF0C;&#x90A3;&#x4E48;&#x5F88;&#x5BB9;&#x6613;&#x8BA1;&#x7B97;&#x51FA;${\log {p_m}({\bf{d}}|{\theta _m})}$&#x548C;${\log {p_m}({\bf{\hat d}}|{\theta _m})}$&#x7684;&#x5BFC;&#x6570;&#x3002;&#x4ECE;$Q^0$&#x548C;$Q^1$&#x4E2D;&#x91C7;&#x6837;&#x4E5F;&#x6BD4;&#x8F83;&#x76F4;&#x89C2;&#x53EF;&#x884C;&#xFF0C;&#x56E0;&#x6B64;&#x7B49;&#x5F0F;&#x53F3;&#x8FB9;&#x524D;&#x4E24;&#x9879;&#x7684;&#x503C;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x5F97;&#x5230;&#x3002;$Q^1$&#x7684;&#x65E0;&#x504F;&#x91C7;&#x6837;&#x6D41;&#x7A0B;&#x5982;&#x4E0B;</p>
<ol>
<li>&#x5728;&#x6570;&#x636E;&#x5206;&#x5E03;$Q^0$&#x4E2D;&#xFF0C;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5411;&#x91CF;&#xFF0C;$\bf{d}$</li>
<li>&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x5355;&#x6A21;&#x578B;&#xFF0C;&#x7ED9;&#x5B9A;&#x6570;&#x636E;&#x5411;&#x91CF;$\bf{d}$&#xFF0C;&#x5206;&#x522B;&#x8BA1;&#x7B97;&#x5176;&#x540E;&#x9A8C;&#x6982;&#x7387;&#x5206;&#x5E03;</li>
<li>&#x4ECE;&#x540E;&#x9A8C;&#x6982;&#x7387;&#x5206;&#x5E03;&#x4E2D;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x8D4B;&#x7ED9;&#x9690;&#x542B;&#x5C42;&#x53D8;&#x91CF;</li>
<li>&#x7ED9;&#x5B9A;&#x9690;&#x542B;&#x5C42;&#x53D8;&#x91CF;&#x540E;&#xFF0C;&#x5C06;&#x6BCF;&#x4E2A;&#x5355;&#x6A21;&#x578B;&#x7684;&#x6761;&#x4EF6;&#x5206;&#x5E03;&#x4E58;&#x79EF;&#x540E;&#x8BA1;&#x7B97;&#x53EF;&#x89C1;&#x5C42;&#x53D8;&#x91CF;&#x7684;&#x6761;&#x4EF6;&#x5206;&#x5E03;&#x3002;</li>
<li>&#x4ECE;&#x6761;&#x4EF6;&#x5206;&#x5E03;&#x4E2D;&#x4E3A;&#x6BCF;&#x4E2A;&#x53EF;&#x89C1;&#x53D8;&#x91CF;&#x9009;&#x53D6;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x8FD9;&#x4E9B;&#x503C;&#x6784;&#x6210;&#x4E86;&#x91CD;&#x5EFA;&#x540E;&#x7684;&#x6570;&#x636E;&#x5411;&#x91CF;$\bf{\hat d}$</li>
</ol>
<p>&#x516C;&#x5F0F;&#xFF08;6&#xFF09;&#x7B49;&#x5F0F;&#x53F3;&#x8FB9;&#x7684;&#x7B2C;&#x4E09;&#x9879;&#x4E5F;&#x662F;&#x76F8;&#x5F53;&#x96BE;&#x7B97;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x6A21;&#x62DF;&#x8868;&#x660E;&#xFF0C;&#x7531;&#x4E8E;&#x8FD9;&#x9879;&#x5F88;&#x5C0F;&#x5E76;&#x6781;&#x5C11;&#x4E0E;&#x524D;&#x4E24;&#x9879;&#x8868;&#x73B0;&#x51FA;&#x76F8;&#x53CD;&#x6027;&#x8D28;&#xFF0C;&#x53EF;&#x4EE5;&#x88AB;&#x5FFD;&#x7565;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x901A;&#x8FC7;&#x524D;&#x4E24;&#x9879;&#x6765;&#x8FD1;&#x4F3C;contrastive divergence&#x7684;&#x5BFC;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x8C03;&#x8282;&#x6A21;&#x578B;&#x7684;&#x53C2;&#x6570;&#x3002;<br>$$\Delta {\theta _m} \propto {\langle {{{\partial \log {p_m}({\bf{d}}|{\theta _m})} \over {\partial {\theta _m}}}} \rangle _{{Q^0}}} - {\langle {{{\partial \log {p_m}({\bf{\hat d}}|{\theta _m})} \over {\partial {\theta _m}}}} \rangle _{{Q^1}}}$$</p>
<p>&#x4F7F;&#x7528;&#x7B2C;&#x4E00;&#x6B65;&#x91CD;&#x5EFA;&#x7684;&#x6570;&#x636E;&#x5411;&#x91CF;&#x6765;&#x4EE3;&#x66FF;&#x6700;&#x7EC8;&#x7684;&#x91CD;&#x5EFA;&#x7684;&#x6982;&#x7387;&#x5206;&#x5E03;&#x662F;&#x4E00;&#x79CD;&#x884C;&#x4E4B;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x7531;&#x4E8E;&#x91CD;&#x5EFA;&#x7684;&#x8FC7;&#x7A0B;&#x6709;&#x968F;&#x673A;&#x6027;&#xFF0C;&#x6570;&#x636E;&#x5411;&#x91CF;&#x7684;&#x5BFC;&#x6570;&#x548C;&#x4ED6;&#x4EEC;&#x91CD;&#x5EFA;&#x6570;&#x636E;&#x5B58;&#x5728;&#x504F;&#x5DEE;&#x3002;&#x5F53;PoE&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#x5408;&#x5B9C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6570;&#x636E;&#x7ECF;&#x8FC7;&#x4E00;&#x6B65;&#x91CD;&#x5EFA;&#x4E0E;&#x6570;&#x636E;&#x5411;&#x91CF;&#x7684;&#x5DEE;&#x522B;&#x975E;&#x5E38;&#x5C0F;&#x3002;</p>
<p>&#x53C2;&#x8003;&#x6587;&#x7AE0;&#xFF1A;<br>1.Hinton G E. <a href="http://www-clmc.usc.edu/publications/H/hinton-NC2002.pdf" target="_blank" rel="external">Training products of experts by minimizing contrastive divergence</a>[J]. Neural computation, 2002, 14(8): 1771-1800.</p>
<hr>
</div><script type="text/javascript" src="/js/share.js?v=0.0.0" async></script><a data-url="https://qiugen.github.io/2014/05/11/Training-Products-of-Experts-by-Minimizing-Contrastive-Divergence/" data-id="citsl6o3o00011clp07r0rsn1" class="article-share-link">分享到</a><div class="tags"><a href="/tags/RBMs/">RBMs</a><a href="/tags/deep-learning/">deep learning</a></div><div class="post-nav"><a href="/2016/09/03/solved-mathjex-problem/" class="pre">解决hexo(jekyll) mathjex 插入公式后渲染问题</a><a href="/2014/03/02/naive-bayes-classify/" class="next">朴素贝叶斯分类算法简介</a></div><div data-thread-key="2014/05/11/Training-Products-of-Experts-by-Minimizing-Contrastive-Divergence/" data-title="[笔记]Training Products of Experts by Minimizing Contrastive Divergence" data-url="https://qiugen.github.io/2014/05/11/Training-Products-of-Experts-by-Minimizing-Contrastive-Divergence/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2014/05/11/Training-Products-of-Experts-by-Minimizing-Contrastive-Divergence/" data-title="[笔记]Training Products of Experts by Minimizing Contrastive Divergence" data-url="https://qiugen.github.io/2014/05/11/Training-Products-of-Experts-by-Minimizing-Contrastive-Divergence/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4 hidden_mid_and_down"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search"/><input type="hidden" name="si" value="https://qiugen.github.io"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/其他/">其他</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/机器学习/">机器学习</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/user-targeting/" style="font-size: 15px;">user targeting</a> <a href="/tags/RBMs/" style="font-size: 15px;">RBMs</a> <a href="/tags/learning-to-rank/" style="font-size: 15px;">learning to rank</a> <a href="/tags/query-rewriting/" style="font-size: 15px;">query rewriting</a> <a href="/tags/semantic-matching/" style="font-size: 15px;">semantic matching</a> <a href="/tags/gbRank/" style="font-size: 15px;">gbRank</a> <a href="/tags/logisticRank/" style="font-size: 15px;">logisticRank</a> <a href="/tags/gbdt/" style="font-size: 15px;">gbdt</a> <a href="/tags/gradient-boosting-framework/" style="font-size: 15px;">gradient boosting framework</a> <a href="/tags/deep-learning/" style="font-size: 15px;">deep learning</a> <a href="/tags/advertisement/" style="font-size: 15px;">advertisement</a> <a href="/tags/model/" style="font-size: 15px;">model</a> <a href="/tags/bayes/" style="font-size: 15px;">bayes</a> <a href="/tags/huber/" style="font-size: 15px;">huber</a> <a href="/tags/LST/" style="font-size: 15px;">LST</a> <a href="/tags/LAD/" style="font-size: 15px;">LAD</a> <a href="/tags/classify/" style="font-size: 15px;">classify</a> <a href="/tags/hexo/" style="font-size: 15px;">hexo</a> <a href="/tags/mathjex-公式/" style="font-size: 15px;">mathjex 公式</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/10/02/gradient-boosting-decision-tree-2/">gradient boosting decision tree[下篇]</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/09/24/gradient-boosting-decision-tree-1/">gradient boosting decision tree[上篇]</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/09/18/gbRank-logsitRank-from-up-to-bottom/">gbRank & logsitcRank自顶向下</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/09/13/Ranking-Relevance-in-Yahoo-Search/">[笔记]Ranking Relevance in Yahoo Search</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/09/03/Large-scale-behavioral-user-targeting/">[笔记]Large-scale behavioral user targeting</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/09/03/solved-mathjex-problem/">解决hexo(jekyll) mathjex 插入公式后渲染问题</a></li><li class="post-list-item"><a class="post-list-link" href="/2014/05/11/Training-Products-of-Experts-by-Minimizing-Contrastive-Divergence/">[笔记]Training Products of Experts by Minimizing Contrastive Divergence</a></li><li class="post-list-item"><a class="post-list-link" href="/2014/03/02/naive-bayes-classify/">朴素贝叶斯分类算法简介</a></li><li class="post-list-item"><a class="post-list-link" href="/2013/05/29/徐志摩诗一首/">再休怪我的脸沉</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://www.example1.com/" title="site-name1" target="_blank">site-name1</a><ul></ul><a href="http://www.example2.com/" title="site-name2" target="_blank">site-name2</a><ul></ul><a href="http://www.example3.com/" title="site-name3" target="_blank">site-name3</a></div></div></div><div class="pure-u-1 pure-u-md-3-4"><div id="footer">© <a href="/." rel="nofollow">水滴石穿.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div></div></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/totop.js?v=0.0.0" async></script><script type="text/javascript" src="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.pack.js" async></script><script type="text/javascript" src="/js/fancybox.js?v=0.0.0" async></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'qiugen'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/x-mathjax-config">MathJax.Hub.Config({
  tex2jax: {inlineMath: [['$','$'], ['\\(','\\)']]}
  });
</script><script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-MML-AM_CHTML" async></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>